app/controllers/sportsplayers_controller.rb

    def index
        @sportsplayers = Sportsplayer.all
---
SELECT "sportsplayers".* FROM "sportsplayers"

    def show
        @sportsplayer = Sportsplayer.find(params[:id])
---
SELECT "sportsplayers".* FROM "sportsplayers" WHERE "sportsplayers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @sportsplayer = Sportsplayer.find_or_create_by(approved_params(:name, :number, :position, :string, :sport))
---
INSERT INTO "sportsplayers" ("name", "number", "position", "string", "sport", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "sportsplayers".* FROM "sportsplayers" WHERE "sportsplayers"."name" = ? AND "sportsplayers"."number" = ? AND "sportsplayers"."position" = ? AND "sportsplayers"."string" = ? AND "sportsplayers"."sport" = ? LIMIT ?  [["name", "Babe Ruth"], ["number", 12], ["position", "Pitcher"], ["string", "Blue"], ["sport", "Baseball"], ["LIMIT", 1]]

    def edit
        @sportsplayer = Sportsplayer.find(params[:id])
---
SELECT "sportsplayers".* FROM "sportsplayers" WHERE "sportsplayers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @sportsplayer = Sportsplayer.find(params[:id])
        @sportsplayer.update(approved_params(:number, :position, :string, :sport))
---
SELECT "sportsplayers".* FROM "sportsplayers" WHERE "sportsplayers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "sportsplayers" SET "position" = ?, "string" = ?, "updated_at" = ? WHERE "sportsplayers"."id" = ?  [["position", "Pitcher"], ["string", "Blue"], ["updated_at", "2020-09-18 16:54:42.260321"], ["id", 1]]

    def destroy
        Sportsplayer.destroy(params[:id])
---
DELETE FROM "sportsplayers" WHERE "sportsplayers"."id" = ?  [["id", 4]]

    def delete_all
        Sportsplayer.destroy_all
---
DELETE FROM "sportsplayers" WHERE "sportsplayers"."id" = ?  [["id", 2]]